
Операторы С#
- арифметические
- поразрядные
- логические
- отношения

Арифметические:
+ сложения
- вычитания
* умножения
/ деление
% деление по модулю (оператор вычисления остатка)
--декремент
++ инкремент

/ - когда применяется к целому числу, остаток отбрасывается 10/3=3
% - 10%3=1

оператор инкремента (++)
декремента (--)

Операторы отношения:
== равно
!= не равно
> больше
< меньше
>= больше или равно
<= меньше или равно

Логические
& и
| или
^ исключающее или
&& укороченное и
|| укороченное или
! не

Операторы сдвига

значение << число_битов
значение >> число_битов
где число_битов - это число дыоичных разрядов, на которое сдвигается указанное значение.

При сдвиге вправо целое значение удваивается, а при сдвиге влево - уменьшается наполовину (это справедливо, если крайние разряды не теряются)

Оператор ? - тенарный
Часто используется вместо if-then-else
	Выражение 1? Выражение2: Выражение 3;
относится к типу bool









