
Операторы С#
- арифметические
- поразрядные
- логические
- отношения

Арифметические:
+ сложения
- вычитания
* умножения
/ деление
% деление по модулю (оператор вычисления остатка)
--декремент
++ инкремент

/ - когда применяется к целому числу, остаток отбрасывается 10/3=3
% - 10%3=1

оператор инкремента (++)
декремента (--)

Операторы отношения:
== равно
!= не равно
> больше
< меньше
>= больше или равно
<= меньше или равно

Логические
& и
| или
^ исключающее или
&& укороченное и
|| укороченное или
! не