Главные конструкции программирования на с#

Все ключевые слова с# вводятся в нижнем регистре (н-р, public, lock,class, dynamic), а названия пространств имен, типов и членов с заглавной и имеют заглавные буквы в любых содержащихся внутри словах (Console.WriteLine, System.Windows.MessageBox)

метод Main

Класс, который опредедяет метод Main(), называется обьектом приложения
сигнатура Main снабжена ключ.словом static
static void Main (string []args) - то что в скобках - єто масивстрок
void  - возращаемое значение


Класс Console, пространство имен System
статический метод WriteLine ()
метод Console.ReadLine()
"var" - необходимо использовать при обьявлении переменных анонимного типа или коллекций анонимных типов.
