Избранные свойства типа System.Environment

ExitCode - Получает или устанавливает код возврата для приложения
Is64Bit0peratingSystem - Возвращает булевское значение, которое представляет признак наличия на текущей машине 54-разрядной операционной системы
MachineName - Возвращает имя текущей машины
NewLine - Возвращает символ новой строки для текущей среды
SystemDirectory - Возвращает полный путь к каталогу системы
UserName - Возвращает имя пользователя, запустившего данное приложение
Version - Возвращает объект Ve r s ion, который представляет версию платформы .NET




Избранные члены класса System. Console

Веер () - Этот метод заставляет консоль выдать звуковой сигнал указанной частоты и длительности
BackgroundColor - Эти свойства устанавливают цвета фона и переднего nлана для текущего вывода. Им может быть nрисвоен любой член nеречисления ConsoleColor
ForegroundColor
BufferHeight - Эти свойства уnравляют высотой и шириной буферной области консоли
BufferWidth
Title - Это свойство nолучает или устанавливает заголовок текущей консоли
WindowHeight - Эти свойства уnравляют размерами консоли по отношению к установленному буферу
WindowWidth
WindowTop
WindowLeft
Clear ( ) - Этот метод очищает установленный буфер и область отображения консоли
